Revit 2026 API

# IExternalApplication Methods

---

The IExternalApplication type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | OnShutdown | Implement this method to execute some tasks when Autodesk Revit shuts down. |
|  | OnStartup | Implement this method to execute some tasks when Autodesk Revit starts. |

#### Reference

IExternalApplication Interface

Autodesk.Revit.UI Namespace